{"generatedBy": "keras v2.2.4-tf", "format": "layers-model", "convertedBy": "TensorFlow.js Converter v1.2.10.1", "weightsManifest": [{"weights": [{"shape": [3, 3, 1, 16], "name": "conv2d/kernel", "dtype": "float32"}, {"shape": [16], "name": "conv2d/bias", "dtype": "float32"}, {"shape": [3, 3, 16, 32], "name": "conv2d_1/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_1/bias", "dtype": "float32"}, {"shape": [3, 3, 32, 64], "name": "conv2d_2/kernel", "dtype": "float32"}, {"shape": [64], "name": "conv2d_2/bias", "dtype": "float32"}, {"shape": [576, 128], "name": "dense/kernel", "dtype": "float32"}, {"shape": [128], "name": "dense/bias", "dtype": "float32"}, {"shape": [128, 10], "name": "dense_1/kernel", "dtype": "float32"}, {"shape": [10], "name": "dense_1/bias", "dtype": "float32"}], "paths": ["group1-shard1of1.bin"]}], "modelTopology": {"backend": "tensorflow", "model_config": {"config": {"name": "sequential", "layers": [{"config": {"strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "name": "conv2d", "activation": "relu", "data_format": "channels_last", "filters": 16, "kernel_constraint": null, "padding": "same", "dtype": "float32", "kernel_regularizer": null, "trainable": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "batch_input_shape": [null, 28, 28, 1], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "dtype": "float32", "name": "max_pooling2d", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "name": "conv2d_1", "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "padding": "same", "dtype": "float32", "kernel_regularizer": null, "trainable": true, "kernel_size": [3, 3], "filters": 32, "dilation_rate": [1, 1], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "dtype": "float32", "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "name": "conv2d_2", "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "padding": "same", "dtype": "float32", "kernel_regularizer": null, "trainable": true, "kernel_size": [3, 3], "filters": 64, "dilation_rate": [1, 1], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "dtype": "float32", "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten", "trainable": true, "data_format": "channels_last", "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 128, "name": "dense", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "trainable": true, "activation": "relu", "use_bias": true}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 10, "name": "dense_1", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "trainable": true, "activation": "softmax", "use_bias": true}, "class_name": "Dense"}]}, "class_name": "Sequential"}, "keras_version": "2.2.4-tf"}}